Examinator/src/InformationRegisters/ЗависимостиДанныхВебКабинетаСУ/ЗависимостиДанныхВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗависимостиДанныхВебКабинетаСУ</name>
  <dimensions>
    <name>Зависимость</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ЗависимостиДанныхВебКабинетаСУ/ManagerModule.bsl
Процедура ДобавитьДанные(СсылкаНаОбъект, ОбъектМетаданныхСтрока, Зависимости) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(СсылкаНаОбъект);
	НаборЗаписей.Отбор.ОбъектМетаданных.Установить(ОбъектМетаданныхСтрока);
	
	Если ТипЗнч(Зависимости) = Тип("Массив") Тогда
		
		МассивДобавленныхЗависимостей = Новый Массив;
		
		Для каждого Зависимость Из Зависимости Цикл
			
			Если НЕ ЗначениеЗаполнено(Зависимость) Тогда
				Продолжить;
			КонецЕсли;
			
			Если МассивДобавленныхЗависимостей.Найти(Зависимость) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.СсылкаНаОбъект = СсылкаНаОбъект;
			НоваяЗапись.ОбъектМетаданных = ОбъектМетаданныхСтрока;
			НоваяЗапись.Зависимость = Зависимость;		
			
			МассивДобавленныхЗависимостей.Добавить(Зависимость);
			
		КонецЦикла;
		
	Иначе
		
		Если ЗначениеЗаполнено(Зависимость) Тогда
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.СсылкаНаОбъект = СсылкаНаОбъект;
			НоваяЗапись.ОбъектМетаданных = ОбъектМетаданныхСтрока;
			НоваяЗапись.Зависимость = Зависимость;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();		
	
КонецПроцедуры

Процедура УдалитьДанные(СсылкаНаОбъект, ОбъектМетаданныхСтрока) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(СсылкаНаОбъект);
	НаборЗаписей.Отбор.ОбъектМетаданных.Установить(ОбъектМетаданныхСтрока);
	
	НаборЗаписей.Записать();	
	
КонецПроцедуры
